controllers/admin/DashboardController.php

SELECT SUM(total_amount) FROM `order` WHERE (`created_at` >= 1767646800) AND (`created_at` >= 1767277154)
---
    public function actionSettings()
    {
        // Только админ может изменять настройки
        if (!$this->isAdmin()) {
            throw new NotFoundHttpException('Доступ запрещен.');
        }

        $settings = CompanySettings::find()->orderBy(['id' => SORT_ASC])->one();
        if (!$settings) {
            $settings = new CompanySettings();
        }

        $statuses = OrderStatus::find()->orderBy(['sort' => SORT_ASC])->all();

        if (Yii::$app->request->isPost) {
            $post = Yii::$app->request->post();

            // Сохранение реквизитов компании
            if ($settings->load($post) && $settings->validate()) {