controllers/admin/PoizonController.php

SELECT COUNT(*) FROM `import_batch`
SELECT COUNT(*) FROM `import_batch` WHERE `status`='failed'
SELECT COUNT(*) FROM `product` WHERE NOT (`poizon_id` IS NULL)
SELECT SUM(error_count) FROM `import_batch`
SELECT * FROM `import_batch` ORDER BY `created_at` DESC
---
    protected function getImportStats()
    {
        $totalBatches = ImportBatch::find()->count();
        $successfulBatches = ImportBatch::find()->where(['status' => 'completed'])->count();
        $failedBatches = ImportBatch::find()->where(['status' => 'failed'])->count();

        // Подсчет общего количества импортированных товаров
        $totalProductsImported = Product::find()->where(['not', ['poizon_id' => null]])->count();

        // Подсчет общего количества ошибок из всех батчей
        $totalErrors = ImportBatch::find()->sum('error_count') ?? 0;