controllers/admin/SizeGridController.php

    public function actionIndex()
    {
        $dataProvider = new ActiveDataProvider([
            'query' => SizeGrid::find()->with(['brand'])->orderBy(['created_at' => SORT_DESC]),
            'pagination' => ['pageSize' => 20],
        ]);
---
SELECT COUNT(*) FROM `size_grid`

    public function actionCreate()
    {
        $model = new SizeGrid();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            $this->flashSuccess('Размерная сетка создана');
            return $this->redirect(['/admin/size-grid/edit', 'id' => $model->id]);
        }

        $brands = Brand::find()->orderBy(['name' => SORT_ASC])->all();
---
SELECT `name`, `id` FROM `brand` ORDER BY `name`