controllers/admin/StatisticsController.php

    public function actionIndex()
    {
        // Статистика по статусам
        $statusStats = [];
        foreach (Yii::$app->settings->getStatuses() as $key => $label) {
            $count = Order::find()->where(['status' => $key])->count();
            $statusStats[$label] = $count;
        }

        // Статистика по менеджерам
        $managerStats = User::find()
            ->where(['role' => User::ROLE_MANAGER])
            ->with(['createdOrders'])
            ->all();

        // Статистика по логистам
        $logistStats = User::find()
            ->where(['role' => User::ROLE_LOGIST])
            ->with(['assignedOrders'])
            ->all();

        // Общая статистика
        $totalOrders = Order::find()->count();
        $totalAmount = Order::find()->sum('total_amount');
        $pendingPayment = Order::find()->where(['status' => 'created'])->count();
        $completedOrders = Order::find()->where(['status' => 'issued'])->count();
---
SELECT COUNT(*) FROM `order` WHERE `status`='created'
SELECT * FROM `user` WHERE `role`='manager'
SELECT * FROM `user` WHERE `role`='logist'
SELECT COUNT(*) FROM `order`
SELECT SUM(total_amount) FROM `order`
SELECT COUNT(*) FROM `order` WHERE `status`='issued'