controllers/CatalogController.php

SELECT COUNT(*) FROM `product` WHERE (`is_active`=1) AND (`stock_status` != 'out_of_stock')
---
    public function actionFilterSef($filters = '')
    {
        // Парсим SEF URL
        $parsedFilters = SmartFilter::parseSefUrl($filters);

        // Применяем фильтры
        $query = Product::find()
            ->with(['brand', 'category'])
            ->where(['is_active' => 1])
            ->andWhere(['!=', 'stock_status', Product::STOCK_OUT_OF_STOCK]); // Скрываем "нет в наличии"

        $query = $this->applyParsedFilters($query, $parsedFilters);

        $totalCount = $query->count();