controllers/SiteController.php

    private function render404()
    {
        $this->layout = 'public';
        Yii::$app->response->statusCode = 404;

        // Получаем популярные бренды
        $brands = \app\models\Brand::find()
            ->where(['is_active' => 1])
            ->orderBy(['sort_order' => SORT_ASC])
            ->limit(8)
            ->all();
---
SELECT * FROM `brand` WHERE `is_active`=1 ORDER BY `sort_order` LIMIT 8