components/Settings.php

    public function getStatuses(bool $onlyKeys = false, bool $includeInactive = false): array
    {
        if ($this->_statuses === null) {
            $query = OrderStatus::find()->orderBy(['sort' => SORT_ASC]);
            if (!$includeInactive) {
                $query->where(['is_active' => 1]);
            }
            $this->_statuses = $query->asArray()->all();
---
SELECT * FROM `order_status` WHERE `is_active`=1 ORDER BY `sort`