models/User.php

SELECT * FROM `user` WHERE (`id`=1) AND (`status`=10)
---
    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['auth_key' => $token, 'status' => self::STATUS_ACTIVE]);